# TODO импортируйте библиотеку
import numpy as np

# TODO считайте изображение "image.png"
#img = 

# TODO выведите основную информацию об изображение в консоль. Вместо 0 впишите подходящую функцию/переменную

# dimensions =
print(f"Image shape: {0}")
print(f"Высота (количество строк): {0}")
print(f"Ширина (количество столбцов): {0}")
print(f"Количество каналов: {dimensions[2] if len(dimensions) > 2 else 1}")


# Сделаем изображение зеленым
green = np.zeros_like(img) # создаем пустую черную копию изображения
green[:, :, 1] = img[:, :, 1]   # копируем из оригинального изображения только зеленый канал

# Выводим оригинальное изображение
cv2.imshow("Photo", img)
# TODO выведите изображение green

cv2.waitKey(0)
